#ifndef EEPROM_H
#define EEPROM_H
#include <stdint.h>

/**
 * @brief Адреса в пам'яті EEPROM для збереження режиму (Швидкість, Енергія, Скорострільність)
 */
#define EEPROM_ADDR_MODE  0x4000

/**
 * @brief Адреса в пам'яті EEPROM для збереження індексу ваги кульки
 */
#define EEPROM_ADDR_WEIGHT 0x4001

/**
 * @brief Читання одного байта з енергонезалежної пам'яті (EEPROM).
 * @note Оскільки в архітектурі STM8 EEPROM спроектована у загальному 
 * адресному просторі, читання виконується прямим розіменуванням вказівника.
 * @param addr Фізична адреса в EEPROM (наприклад, 0x4000).
 * @return uint8_t Прочитаний байт даних.
 */
uint8_t EEPROM_Read(uint16_t addr);

/**
 * @brief Запис одного байта в енергонезалежну пам'ять (EEPROM).
 * @details Включає перевірку на співпадіння даних (щоб не витрачати ресурс пам'яті).
 * Якщо дані відрізняються, виконується апаратне розблокування Data EEPROM 
 * за допомогою двох магічних ключів (0xAE, 0x56). Після запису функція чекає 
 * прапорця завершення (EOP) і знову блокує пам'ять.
 * @param addr Фізична адреса в EEPROM.
 * @param data Байт даних для запису.
 */
void EEPROM_Write(uint16_t addr, uint8_t data);

#endif